SoCXin/AT32F413/src/NET/PUB/CH561NET.H
/********************************** (C) COPYRIGHT *********************************
* File Name          : CH563NET.H
* Author             : tech10
* Version            : V1.0
* Date               : 2017/3/8
* Description        : C Define for CH561NET.LIB
*                      Website: http://wch.cn
*                      Email:   tech@wch.cn         
**********************************************************************************/

#ifndef __CH561NET_H__
#define __CH561NET_H__

/* 库版本信息 */
#define CH563NET_LIB_VER                      0X07                   /* 库版本信息 */

#ifdef __cplusplus
extern "C" {
#endif

#ifndef     TRUE
#define     TRUE    1
#define     FALSE   0
#endif
#ifndef     NULL
#define     NULL    0
#endif


/* Socket的个数 */
#ifndef CH563NET_MAX_SOCKET_NUM
#define CH563NET_MAX_SOCKET_NUM               4                                 /* Socket的个数，用户可以配置，默认为4个Socket,最大为32 */
#endif

#ifndef RX_QUEUE_ENTRIES
#define RX_QUEUE_ENTRIES                      4                                 /* CH563 MAC接收描述符队列，此值不得小于2,可配置默认为7，最大为32 */
#endif                                                                          /* #ifndef RX_QUEUE_ENTRIES */
                                                                                
#ifndef RX_BUF_SIZE
#define RX_BUF_SIZE                           0x5ec                             /* CH563 MAC接收每个缓冲区长度，为4的整数倍 */
#endif

#ifndef CH563NET_PING_ENABLE                                                    
#define CH563NET_PING_ENABLE                  TRUE                              /* 默认PING开启 */
#endif                                                                          /* PING使能 */   
                                                                                
#ifndef TCP_RETRY_COUNT                                                         
#define TCP_RETRY_COUNT                       20                                /* TCP重试次数，位宽为5位*/
#endif                                                                          
                                                                                
#ifndef TCP_RETRY_PERIOD                                                        
#define TCP_RETRY_PERIOD                      10                                /* TCP重试周期，单位为50MS，位宽为5位 */
#endif                                                                          
                                                                                
#ifndef CH563NETTIMEPERIOD                                                      
#define CH563NETTIMEPERIOD                    10                                /* 定时器周期，单位Ms,不得大于500 */
#endif                                                                          
                                                                                
#define MAC_INT_TYPE_IRQ                      0                                 /* 以太网使用irq中断 */
#define MAC_INT_TYPE_FIQ                      1                                 /* 以太网使用frq中断 */
                                                                                
#ifndef MAC_INT_TYPE                                                            
#define MAC_INT_TYPE                          MAC_INT_TYPE_IRQ                  /* 默认以太网使用IRQ中断 */
#endif                                                                          
                                                                                
#ifndef SOCKET_SEND_RETRY                                                       
#define SOCKET_SEND_RETRY                     1                                 /* 默认发送重试 */
#endif                    

#define TX_QUEUE_ENTRIES                      2                                 /* CH563 MAC发送描述符队列为2 */
#define LIB_CFG_VALUE                         ((SOCKET_SEND_RETRY << 25) |\
                                              (MAC_INT_TYPE << 24) |\
                                              (TCP_RETRY_PERIOD << 19) |\
                                              (TCP_RETRY_COUNT << 14) |\
                                              (CH563NET_PING_ENABLE << 13) |\
                                              (TX_QUEUE_ENTRIES << 9) |\
                                              (RX_QUEUE_ENTRIES << 5) |\
                                              (CH563NET_MAX_SOCKET_NUM))
#ifndef MISCE_CFG0_TCP_SEND_COPY 
#define MISCE_CFG0_TCP_SEND_COPY              1                                 /* TCP发送缓冲区复制 */
#endif                                                                          

#ifndef MISCE_CFG0_TCP_RECV_COPY                                                
#define MISCE_CFG0_TCP_RECV_COPY              1                                 /* TCP接收复制优化，内部调试使用 */
#endif                                                                          

#ifndef MISCE_CFG0_TCP_OLD_DELETE                                               
#define MISCE_CFG0_TCP_OLD_DELETE             0                                 /* 删除最早的TCP连接 */
#endif

/*关于内存分配 */
#ifndef CH563NET_NUM_IPRAW
#define CH563NET_NUM_IPRAW                    4                                 /* IPRAW连接的个数 */ 
#endif

#ifndef CH563NET_NUM_UDP
#define CH563NET_NUM_UDP                      4                                 /* UDP连接的个数 */                                   
#endif

#ifndef CH563NET_NUM_TCP
#define CH563NET_NUM_TCP                      4                                 /* TCP连接的个数 */ 
#endif

#ifndef CH563NET_NUM_TCP_LISTEN
#define CH563NET_NUM_TCP_LISTEN               4                                 /* TCP监听的个数 */
#endif

#ifndef CH563NET_NUM_PBUF
#define CH563NET_NUM_PBUF                     5                                 /* PBUF结构的个数 */
#endif

#ifndef CH563NET_NUM_POOL_BUF
#define CH563NET_NUM_POOL_BUF                 4                                /* POOL BUF的个数 */
#endif

#ifndef CH563NET_NUM_TCP_SEG
#define CH563NET_NUM_TCP_SEG                  4                                /* tcp段的个数*/
#endif

