SoCXin/AT32F413/src/NET/PUB/CH561NET.H
/* 内存以及杂项配置 */
struct _CH563_CFG
{
    UINT32 RxBufSize;                                                            /* MAC接收缓冲区大小 */
    UINT32 TCPMss;                                                               /* TCP MSS大小 */
    UINT32 HeapSize;                                                             /* 堆分配内存大小 */
    UINT32 ARPTableNum;                                                          /* ARP列表个数 */
    UINT32 MiscConfig0;                                                          /* 其他杂项配置 */
};

/* KEEP LIVE配置结构体 */
struct _KEEP_CFG
{
   UINT32 KLIdle;                                                               /* KEEPLIVE空闲时间 */
   UINT32 KLIntvl;                                                              /* KEEPLIVE周期 */
   UINT32 KLCount;                                                              /* KEEPLIVE次数 */
};
/* 库内部变量声明 */
extern UINT8  CH563IPIntStatus;                                                 /* 中断状态 */
extern struct _CH563_SYS   CH563Inf;                                            /* 系统信息列表 */
extern UINT32 CH563NETConfig;                                                   /* 库配置，下行说明 */
/* 位0-4 Socket的个数,最大值为31 */
/* 位5-8 MAC 接收描述符的个数，最大值为15 */
/* 位13 PING使能，1为开启PING，0为关闭PING，默认为开启 */
/* 位14-18 TCP重试次数*/
/* 位19-23 TCP重试周期，单位为50毫秒*/
/* 位24 以太网中断类型 */
/* 位25 发送重试配置 */

/* 以下值为固定值不可以更改 */
#define CH563NET_MEM_ALIGN_SIZE(size)         (((size) + CH563NET_MEM_ALIGNMENT - 1) & ~(CH563NET_MEM_ALIGNMENT-1))
#define CH563NET_SIZE_IPRAW_PCB               0x1C                              /* IPRAW PCB大小 */
#define CH563NET_SIZE_UDP_PCB                 0x20                              /* UDP PCB大小 */
#define CH563NET_SIZE_TCP_PCB                 0xAC                              /* TCP PCB大小 */
#define CH563NET_SIZE_TCP_PCB_LISTEN          0x20                              /* TCP LISTEN PCB大小 */
#define CH563NET_SIZE_IP_REASSDATA            0x20                              /* IP分片管理  */
#define CH563NET_SIZE_PBUF                    0x10                              /* Packet Buf */
#define CH563NET_SIZE_TCP_SEG                 0x14                              /* TCP SEG结构 */
#define CH563NET_SIZE_MEM                     0x06                              /* sizeof(struct mem) */
#define CH563NET_SIZE_ARP_TABLE               0x10                              /* sizeof arp table */

#define CH563NET_SIZE_POOL_BUF                CH563NET_MEM_ALIGN_SIZE(CH563NET_TCP_MSS + 40 +14) /* pbuf池大小 */
#define CH563NET_MEMP_SIZE                    ((CH563NET_MEM_ALIGNMENT - 1) + \
                                              (CH563NET_NUM_IPRAW * CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_IPRAW_PCB)) + \
                                              (CH563NET_NUM_UDP * CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_UDP_PCB)) + \
                                              (CH563NET_NUM_TCP * CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_TCP_PCB)) + \
                                              (CH563NET_NUM_TCP_LISTEN * CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_TCP_PCB_LISTEN)) + \
                                              (CH563NET_NUM_TCP_SEG * CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_TCP_SEG)) + \
                                              (CH563NET_NUM_IP_REASSDATA * CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_IP_REASSDATA)) + \
                                              (CH563NET_NUM_PBUF * (CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_PBUF) + CH563NET_MEM_ALIGN_SIZE(0))) + \
                                              (CH563NET_NUM_POOL_BUF * (CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_PBUF) + CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_POOL_BUF))))                    


#define  HEAP_MEM_ALIGN_SIZE                  (CH563NET_MEM_ALIGN_SIZE(CH563NET_SIZE_MEM))
#define  CH563NET_RAM_HEAP_SIZE               (CH563_MEM_HEAP_SIZE + (2 * HEAP_MEM_ALIGN_SIZE) + CH563NET_MEM_ALIGNMENT)
#define  CH563NET_RAM_ARP_TABLE_SIZE          (CH563NET_SIZE_ARP_TABLE * CH563NET_NUM_ARP_TABLE)
/* DNS结构体回调 */
typedef void (*dns_callback)(const char *name, UINT8 *ipaddr, void *callback_arg);

/* 检查配置 */
/* 检查CH563NET_NUM_IPRAW是否不小于1 */
#if(CH563NET_NUM_IPRAW < 1)
#error "CH563NET_NUM_IPRAW Error,Please Config CH563NET_NUM_IPRAW >= 1"
#endif
/* 检查CH563NET_SIZE_UDP_PCB是否不小于1 */
#if(CH563NET_SIZE_UDP_PCB < 1)
#error "CH563NET_SIZE_UDP_PCB Error,Please Config CH563NET_SIZE_UDP_PCB >= 1"
#endif
/* 检查CH563NET_NUM_TCP是否不小于1 */
#if(CH563NET_NUM_TCP < 1)
#error "CH563NET_NUM_TCP Error,Please Config CH563NET_NUM_TCP >= 1"
#endif
/* 检查CH563NET_NUM_TCP_LISTEN是否不小于1 */
#if(CH563NET_NUM_TCP_LISTEN < 1)
#error "CH563NET_NUM_TCP_LISTEN Error,Please Config CH563NET_NUM_TCP_LISTEN >= 1"
#endif
/* 检查字节对齐必须为4的整数倍 */
#if((CH563NET_MEM_ALIGNMENT % 4) || (CH563NET_MEM_ALIGNMENT == 0))
#error "CH563NET_MEM_ALIGNMENT Error,Please Config CH563NET_MEM_ALIGNMENT = 4 * N, N >=1"
#endif
/* TCP最大报文段长度 */
#if((CH563NET_TCP_MSS > 1460) || (CH563NET_TCP_MSS < 60))
#error "CH563NET_TCP_MSS Error,Please Config CH563NET_TCP_MSS >= 60 && CH563NET_TCP_MSS <= 1460"
#endif
/* ARP缓存表个数 */
#if((CH563NET_NUM_ARP_TABLE > 0X7F) || (CH563NET_NUM_ARP_TABLE < 1))
#error "CH563NET_NUM_ARP_TABLE Error,Please Config CH563NET_NUM_ARP_TABLE >= 1 && CH563NET_NUM_ARP_TABLE <= 0X7F"
#endif
/* 检查POOL BUF配置 */
#if(CH563NET_NUM_POOL_BUF < 1)
#error "CH563NET_NUM_POOL_BUF Error,Please Config CH563NET_NUM_POOL_BUF >= 1"
#endif
/* 检查PBUF结构配置 */
#if(CH563NET_NUM_PBUF < 1)
#error "CH563NET_NUM_PBUF Error,Please Config CH563NET_NUM_PBUF >= 1"
#endif
/* 检查IP分配配置 */
#if((CH563NET_NUM_IP_REASSDATA > 10)||(CH563NET_NUM_IP_REASSDATA < 1))
#error "CH563NET_NUM_IP_REASSDATA Error,Please Config CH563NET_NUM_IP_REASSDATA < 10 && CH563NET_NUM_IP_REASSDATA >= 1 "
#endif
/* 检查IP分片大小 */
#if(CH563NET_IP_REASS_PBUFS > CH563NET_NUM_POOL_BUF)
#error "CH563NET_IP_REASS_PBUFS Error,Please Config CH563NET_IP_REASS_PBUFS < CH563NET_NUM_POOL_BUF"
#endif

/* 库内部函数声明 */
UINT8 CH563NET_Init(const UINT8* ip,const UINT8* gwip,const UINT8* mask,const UINT8* macaddr); /* 库初始化 */

UINT8 CH563NET_GetVer(void);                                                    /* 查询库的版本号 */
UINT8 CH563NET_ConfigLIB(struct _CH563_CFG *cfg);                               /* 配置库*/
                                                                                
void  CH563NET_MainTask(void);                                                  /* 库主任务函数，需要一直不断调用 */
                                                                                
void CH563NET_TimeIsr(UINT16 timperiod);                                        /* 时钟中断服务函数，调用前请配置时钟周期 */
                                                                                
void CH563NET_ETHIsr(void);                                                     /* CH563ETH中断服务函数 */ 
                                                                                
